# StairstypeMinimumRunWidth Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairstypeMinimumRunWidth Property
ParameterTypeId Class See Also
---
"Minimum Run Width": Minimum Run Width
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairstypeMinimumRunWidth { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairstypeMinimumRunWidth As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairstypeMinimumRunWidth {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace